app/Controllers/AdminController.php

SELECT *
FROM `appointments`
---
    public function manageAppointments()
    {
        $appointmentModel = new AppointmentModel();
        $data['appointments'] = $appointmentModel->findAll();

SELECT *
FROM `inventories`
---
    public function manageInventories()
    {
        $inventoryModel = new InventoryModel();
        $data['inventories'] = $inventoryModel->findAll();

INSERT INTO `inventories` (`id`, `item_name`, `quantity`) VALUES ('WEC404', 'Azythromizene', '250')
---
    public function addInventory()
    {
        $inventoryModel = new InventoryModel();
        $data = [
            'id' => $this->request->getPost('id'),
            'item_name' => $this->request->getPost('item_name'),
            'quantity' => $this->request->getPost('quantity')
        ];

        if ($inventoryModel->insert($data)) {