app/Controllers/AppointmentsController.php

    public function store()
    {
        $appointmentModel = new AppointmentModel();
        $patientId = session()->get('user_id');  // Retrieve the logged-in user's ID from the session

        // Debug: Check if the patientId is set
        if ($patientId === null) {
            return redirect()->back()->with('error', 'User ID is not set in session');
        }

        $data = [
            'patient_id' => $patientId,
            'doctor_id' => $this->request->getPost('doctor_id'),
            'appointment_date' => $this->request->getPost('appointment_date'),
            'status' => 'Pending'
        ];

        if ($appointmentModel->insert($data)) {
---
INSERT INTO `appointments` (`patient_id`, `doctor_id`, `appointment_date`, `status`) VALUES ('16', '17', '2024-07-09T17:42', 'pending')