app/Controllers/AssistantController.php

SELECT *
FROM `appointments`
---
    public function appointments()
    {
        $appointmentModel = new AppointmentModel();
        $data['appointments'] = $appointmentModel->findAll();

SELECT *
FROM `events`
---
    public function events()
    {
        $eventModel = new EventModel();
        $data['events'] = $eventModel->findAll();

SELECT *
FROM `inventories`
---
    public function inventories()
    {
        $inventoryModel = new InventoryModel();
        $data['inventories'] = $inventoryModel->findAll();

SELECT *
FROM `reports`
---
    public function reports()
    {
        $reportModel = new ReportModel();
        $data['reports'] = $reportModel->findAll();