app/Controllers/AuthController.php

    public function authenticate()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'Dr. Croos'
 LIMIT 1