app/Controllers/DoctorController.php

    public function patients()
    {
        $patientModel = new PatientModel();
        $data['patients'] = $patientModel->findAll();
---
SELECT *
FROM `patients`

    public function patientRecords($patient_id)
    {
        $treatmentModel = new TreatmentModel();
        $userModel = new UserModel();

        // Fetch patient details
        $patientModel = new PatientModel();
        $data['patient'] = $patientModel->find($patient_id);

        // Fetch treatments and corresponding doctor names
        $treatments = $treatmentModel->where('patient_id', $patient_id)->findAll();
        foreach ($treatments as &$treatment) {
            $doctor = $userModel->find($treatment['doctor_id']);
---
SELECT *
FROM `patients`
WHERE `patients`.`id` = '16'
SELECT *
FROM `treatments`
WHERE `patient_id` = '16'
SELECT *
FROM `users`
WHERE `users`.`id` = '17'

    public function addTreatment($appointment_id)
    {
        $appointmentModel = new AppointmentModel();
        $appointment = $appointmentModel->find($appointment_id);
---
SELECT *
FROM `appointments`
WHERE `appointments`.`id` = '12'