app/Controllers/PatientController.php

    public function notifications()
    {
        $notificationModel = new NotificationModel();
        $data['notifications'] = $notificationModel->where('user_id', session()->get('user_id'))->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '16'
ORDER BY `created_at` DESC

    public function treatmentHistory()
    {
        $treatmentModel = new TreatmentModel();
        $data['treatments'] = $treatmentModel->where('patient_id', session()->get('user_id'))->findAll();
---
SELECT *
FROM `treatments`
WHERE `patient_id` = '16'

    public function paymentHistory()
    {
        $paymentModel = new PaymentModel();
        $data['payments'] = $paymentModel->where('patient_id', session()->get('user_id'))->findAll();
---
SELECT *
FROM `payments`
WHERE `patient_id` = '16'

    public function appointments()
    {
        $appointmentModel = new AppointmentModel();
        $userModel = new UserModel();

        // Join appointments with users to get doctor name
        $appointments = $appointmentModel
            ->select('appointments.*, users.username as doctor_name')
            ->join('users', 'users.id = appointments.doctor_id')
            ->where('appointments.patient_id', session()->get('user_id'))
            ->findAll();
---
SELECT `appointments`.*, `users`.`username` as `doctor_name`
FROM `appointments`
JOIN `users` ON `users`.`id` = `appointments`.`doctor_id`
WHERE `appointments`.`patient_id` = '16'