app/Models/SystemStatusModel.php

SELECT *
FROM `system_status`
 LIMIT 1
---
    public function getStatus()
    {
        return $this->first()['status'];